<template>
  <div class="section ryt">
    <div class="container">
      <h1>
        Бачити у дивах диво – <br />ось ключ до усіх таємниць цього світу.
      </h1>
    </div>
  </div>

  <div class="section blue ryt__intro">
    <div class="container">
      <div class="ryt__intro-inner">
        <p class="text-3">
          Раді презентувати вам сертифікаційний курс для йога-інструкторів,
          аналогів якому ще не було в Україні, і який у 5 разів об’ємніший за
          міжнародний сертифікат RYS-200! Отримайте дійсно вичерпні знання та не
          поверхневий досвід, що дозволять вам стрімко розвиватись у обраній
          професії!
        </p>
        <p>
          Для вашої зручності, наш курс розбитий на чотири десятиденні блоки,
          між якими є 3 місяці лекцій із викладачем онлайн. Завдяки такому
          підходу, навіть “зелений” йога-інструктор, перш ніж почати викладацьку
          діяльність матиме понад один рік особистої практики, менторського
          супроводу та якісного власного досвіду, на який він зможе спертись і
          що не обмежуватиметься лише гімнастичними вправами.
        </p>
        <p>
          Ще однією унікальною особливістю нашого курсу є те, що він адаптований
          до сучасних українських реалій. Ми доповнили наш курс грунтовними
          знаннями із психології, реабілітації та йога-терапії, тож ви зможете
          викладати не лише здоровим людям, але й адаптувати практику для людей
          без кінцівок, чи тих, що мають серйозні вади та залучити їх у групи.
          Адже понад усе такі люди хочуть почувати себе нормальними та
          інтегрованими у соціум.
        </p>
      </div>
    </div>
  </div>
</template>

<script setup lang="ts">
</script>

<style lang="sass" scoped>
.ryt h1
  max-width: 80%

.ryt__intro .text-3
  font-weight: 700

.ryt__intro-inner
  display: flex
  flex-direction: column
  gap: 20px
</style>
