<template>
  <div class="about-founder section blue">
    <div class="container">
      <div class="about-founder__inner">
        <div>
          <h2 class="about-founder__inner-title">Цілі асоціації</h2>
          <BaseFeaturesList :features="goals" styles="goals__list" />
        </div>

        <div>
          <h2 class="about-founder__inner-title">Цінності асоціації</h2>
          <BaseFeaturesList :features="values" styles="values__list" />
        </div>
      </div>
    </div>
  </div>
</template>

<script setup lang="ts">
import type { IFeature } from '~/types'

const goals: IFeature[] = [
  {
    id: 1,
    title: 'Соціальні',
    text: [
      'Об’єднання викладачів йоги різних стилів',
      'Підвищення загального рівня компетенції викладачів йоги',
      'Створення чату з пошуку роботи/замін/подій по Україні',
      'Соціально-правовий захист учасників, щодо робочих моментів',
      'Вплив на ціноутворення на йогічному ринку праці. Контроль демпінгу'
    ],
    color: 'var(--orange)'
  },
  {
    id: 2,
    title: 'Навчальні',
    text: [
      'Створення навчальної бази, “університету” йоги де можна отримувати не хаотичну, якісну освіту після проходження базового RYT-200',
      'Проведення менторської діяльності для інструкторів-початківців',
      'Авторитетна cертифікація'
    ],
    color: 'var(--blue-color)'
  },
  {
    id: 3,
    title: 'Наукові',
    text: [
      'Проведення досліджень у напрямку психо-практик, біомеханіки,  реабілітології та лімітів людського організму. Їх публікація',
      'Організація 2-х викладацьких конференцій на рік, де зокрема будуть представлені наші останні дослідження',
      'Публікація наукових праць під брендом асоціації',
      'Створення можливостей, для талановитих йога-інструкторів. Замовлення досліджень на певні теми з їх спонсорством (повним або частковим)'
    ],
    color: 'var(--gray-color)'
  },
  {
    id: 4,
    title: 'Культурні, “ребрендинг” йоги',
    text: [
      'Відокремлення йоги, як дисципліни від фітнес-індустрії, а також від релігії у масовій свідомості',
      'Переорієнтація релігійно налаштованих викладачів у наукове русло',
      'Дискредитація “потокового”, “шаманського” підходу до йоги',
      'Стандартизація та Уніфікація йоги, повернення до першопочаткової йоги, поза авторськими стилями',
      'Проведення загально доступних заходів від асоціації, можливо волонтерського характеру, під гранди і тд'
    ],
    color: 'var(--orange)'
  }
]

const values: IFeature[] = [
  {
    id: 1,
    title: 'Психічне та фізичне здоров’я',
    text: 'Йога - чи не єдина традиція, яка напряму покликана тренувати нервову систему, (все інше - позитивні побічні ефекти). У світі, де навантаження на нервову систему постійно зростає - є величезна необхідність інтеграції подібних практик у масову культуру, пояснення їх доцільності та механізмів її роботи, щоб це було прозоро.',
    color: 'var(--orange)'
  },
  {
    id: 2,
    title: 'Primus inter pares (перший серед рівних)',
    text: 'Разом ми здатні на більше. У той час як самотужки кожен тренер має бути і лікарем, і контент мейкером, і відеографом і тд. У нас людина може займатись тим, що їй дійсно подобається і бути “частиною великого колеса”, зростати як практик і заробляти альтернативними методами (бути дослідником, ментором, чи спробувати себе у менеджменті).',
    color: 'var(--blue-color)'
  },
  {
    id: 3,
    title: 'Твій ріст - у твоїх руках',
    text: 'З нами у кожного є перспективи. Ви можете самі обирати наскільки бути залученими у нашу асоціацію та чим у ній займатись. Початківці можуть набиратись досвіду у професійних менторів, проходити річний викладацький курс та мати доступ до низки авторських курсів наших викладачів за зниженими цінами, приймати участь у дослідженнях та конференціях, волонтерити та багато іншого.',
    color: 'var(--gray-color)'
  }
]
</script>

<style lang="sass" scoped>
.about-founder
  position: relative

.about-founder__inner
  display: flex
  flex-direction: column
  gap: 40px
  @include xl
    gap: 28px
  @include l
    gap: 20px
  @include m
    gap: 12px

</style>
