<template>
  <div>
    <div class="section ryt">
      <div class="container">
        <h1>
          Бачити у дивах диво – <br />ось ключ до усіх таємниць цього світу.
        </h1>
      </div>
    </div>

    <div class="section blue ryt__intro">
      <div class="container">
        <div class="ryt__intro-inner">
          <p class="text-3">
            Раді презентувати вам сертифікаційний курс для йога-інструкторів,
            аналогів якому ще не було в Україні, і який у 5 разів об’ємніший за
            міжнародний сертифікат RYS-200! Отримайте дійсно вичерпні знання та не
            поверхневий досвід, що дозволять вам стрімко розвиватись у обраній
            професії!
          </p>
          <p>
            Для вашої зручності, наш курс розбитий на чотири десятиденні блоки,
            між якими є 3 місяці лекцій із викладачем онлайн. Завдяки такому
            підходу, навіть “зелений” йога-інструктор, перш ніж почати викладацьку
            діяльність матиме понад один рік особистої практики, менторського
            супроводу та якісного власного досвіду, на який він зможе спертись і
            що не обмежуватиметься лише гімнастичними вправами.
          </p>
          <p>
            Ще однією унікальною особливістю нашого курсу є те, що він адаптований
            до сучасних українських реалій. Ми доповнили наш курс грунтовними
            знаннями із психології, реабілітації та йога-терапії, тож ви зможете
            викладати не лише здоровим людям, але й адаптувати практику для людей
            без кінцівок, чи тих, що мають серйозні вади та залучити їх у групи.
            Адже понад усе такі люди хочуть почувати себе нормальними та
            інтегрованими у соціум.
          </p>
        </div>
      </div>
    </div>

    <template v-for="(section, index) in sections" :key="section.id">
      <Ryt1000Section :content="section" :blueBg="section.id % 2 === 0" />
    </template>

    <div class="section">
      <div class="container">
        <h2>Навчання онлайн</h2>
        <p>
          У проміжку між живими навчальними блоками на вас чекатиме
          онлайн-навчання з селф-бренду, логіки, анатомії, психології, історії
          йоги, класичних текстів та інших тем, що неодмінно стануть у нагоді
          кожному йога-інструктору, а також підбірка рекомендуємої літератури, що
          полегшить засвоєння подальшого матеріалу.
        </p>
        <p class="course__online">
          В кінці кожного блоку буде проходити іспит + після четвертого блоку вас
          очікує написання дипломної роботи. Сертифікат видається лише за умови
          здачі усіх іспитів та дипломної на 75 і вище балів (зі 100).
        </p>
      </div>
    </div>

    <div class="section blue course__price">
      <div class="container">
        <h2>Вартість курсу</h2>
        <p class="text-3 first">
          Ми хочемо, щоб ви всеціло були зосереджені на навчанні, тому вже
          включили у вартість доїзд зі Львова, проживання та харчування.
        </p>
        <p class="second">
          Ви маєте можливість оплатити весь курс повністю, кожен блок окремо або
          по півкурсу (1+2 блок або 3+4 блок), зверніть увагу, що фінальна ціна
          курсу від цього змінюється.
        </p>
        <p class="text-3">
          Ціна при оплаті всього курсу (всі 4 блоки) - 2500 доларів
        </p>
        <p class="text-3">
          Ціна при оплаті половини курсу (1+2 блок, 3+4 блок) - 1500
          доларів/півкурсу
        </p>
        <p class="text-3">Ціна при оплаті одного блоку - 900 доларів/блок</p>

        <p class="warning">
          *Ціни актуальні до 01.07.2024, надалі ціни зростатимуть!<br />При оплаті
          50% від вартості за вами фіксується місце та поточна ціна.
        </p>
      </div>
    </div>

    <div class="section">
      <div class="container">
        <div class="course__contacts-wrapper">
          <div class="course__contacts">
            Для реєстрації на курс та з усіх дотичних питань зв’яжіться з нами <br />
            <NuxtLink to="https://t.me/MikeYogatech" target="_blank">
              <Icon name="ph:telegram-logo-thin" width="44" height="44" />
            </NuxtLink>
            або
            <NuxtLink to="mailto:yogatechua@gmail.com">yogatechua@gmail.com</NuxtLink>
          </div>
        </div>
      </div>
    </div>
  </div>
</template>

<script setup lang="ts">
const sections = [
  {
    id: 1,
    title: 'Блок - Атха йогаанушасанам',
    text: [
      'Більшість викладацьких курсів нехтують історією і традицією йоги, левову частину часу приділяючи гімнастиці йогів, якій від сили 500-700років, у той час як сама йога налічує понад 5000 років. Тож ми почнемо її вивчання із насінини і прослідкуємо як вона трансформувалась у цей кремезний баньян, зануримось у складність, красу та глибину індійської філософської думки, розберемось із йогічною термінологією, а також цілями йоги та інструментами їх досягнення. Окрім цього, ми почнемо вивчення будови психіки психології та медитативних технік і вже з перших днів почнемо напрацьовувати свою особисту практику. На завершення, ми розберемось із харчуванням, продуктовими корзинами, бадами та чек-апами.',
      'Вважаємо необхідним зазначити, що цей блок можуть відвідувати не лише майбутні йога-інструктори, але й йоги, що хочуть покращити власну практику та розуміння традиції.'
    ],
    card: {
      id: 1,
      title: 'Теми блоку “Інтро”',
      description: [
        'Історія йоги',
        'Загальна психологія',
        'Медитативні техніки (концентрація, АТ)',
        'Шаткарми',
        'Яма, ніяма, чакри',
        'Базовий розбір асан',
        'Базовий розбір пранаям та пратьяхари',
        'Харчування'
      ],
      icon: 'ph:hand-eye-thin'
    }
  },
  {
    id: 2,
    title: 'Блок - Асани',
    text: [
      'Другий блок буде всеціло присвячений коректній практиці гімнастики йогів. Анатомія, біомеханіка, міофасціальні лінії, зовнішня та внутрішня робота у асанах, їх відбудова, самокорекція та правки, спрощення та ускладнення, алгоритм побудови комплексів та проведення занять голосом.',
      'Окрему увагу буде приділено протипоказанням та адаптації занять для людей без кінцівок, та тих, що мали поранення, і за можливості, інтеграції таких людей у групи.'
    ],
    card: {
      id: 2,
      title: 'Теми блоку “Асани”',
      description: [
        'Анатомія',
        'Біомеханіка',
        'Міофасціальні лінії',
        'Детальний розбір асан',
        'Медитація (Смарана)',
        'Принцип ведення заняття голосом',
        'Відбудова та правки асан',
        'Алгоритми побудови занять'
      ],
      icon: 'ph:person-arms-spread-thin'
    }
  },
  {
    id: 3,
    title: 'Блок - Прана',
    text: [
      'Третім етапом - буде вивчення глибинної анатомії, біомеханіки та біохімії дихання. Ви протестуєте на собі понад 30 дихальних технік із різних стилів йоги і не тільки, дізнаєтесь як вони впливають на наше тіло та розум, навчитесь практиці самозігрівання, корекції тиску в тілі, а також побудові дихальних комплексів та інтеграції дихання у практику гімнастики йогів.'
    ],
    card: {
      id: 3,
      title: 'Теми блоку “Прана”',
      description: [
        'Анатомія дихальної системи',
        'Біохімія процесу дихання',
        'Прана Вьяяма, паттерни дихання',
        'Дихальні техніки, їх вплив та протипокази',
        'Бандхи, Наулі',
        'Медитація (Самадхі)',
        'Вім, Грофф, Кундаліні',
        'Прана в практиці асан',
        'Побудова дихальних комплексів'
      ],
      icon: 'ph:plant-thin'
    }
  },
  {
    id: 4,
    title: 'Блок - Пратьяхара',
    text: [
      'Останній етап вашого навчання - це заглиблення у психологію та особиста практика у стані сенсорної депривації. Ви зможете не лише напрацювати вміння вести групи із такими вадами, а й певною мірою прожити досвід незрячих чи глухих людей. Ми зануримось у роботу нашого мозку та органів сприйняття, зрозуміємо суть обітниць та ретритів.'
    ],
    card: {
      id: 4,
      title: 'Теми блоку “Пратьяхара”',
      description: [
        'Ознайомлення з сенсорною системою',
        'Детальний розбір: зір',
        'Детальний розбір: дотик, смак',
        'Детальний розбір: слух',
        'Детальний розбір: нюх',
        'Медитація (Бхавана)',
        'Інтуїція'
      ],
      icon: 'ph:eye-closed-thin'
    }
  }
]
</script>

<style lang="sass" scoped>
.ryt h1
  max-width: 80%

.ryt__intro .text-3
  font-weight: 700

.ryt__intro-inner
  display: flex
  flex-direction: column
  gap: 20px

.course__online
  margin-top: 20px
  @include m
    margin-top: 16px
.course__price
  & .text-3
    font-weight: 700
    margin-bottom: 20px
    @include xl
      margin-bottom: 16px
    @include m
      margin-bottom: 8px
  & .first
    margin-bottom: 32px
    @include xl
      margin-bottom: 20px
    @include l
      margin-bottom: 16px
    @include m
      margin-bottom: 8px
  & .second
    margin-bottom: 20px
    @include l
      margin-bottom: 16px
    @include m
      margin-bottom: 12px
  & .warning
    color: #FF0000

.course__contacts-wrapper
  display: flex


.course__contacts
  padding: 20px
  border: 1px solid var(--orange)
  border-radius: var(--primary-border-radius)
  display: inline-block
  @include xl
    padding: 12px
  @include l
    text-align: center
    margin-right: auto
    margin-left: auto
  & br
    display: none
    @include l
      display: block

a
  color: var(--blue-color)
</style>
