<template>
  <div class="section">
    <div class="container">
      <BaseGoBackBtn />

      <div>
        <div>
          <h2>Гарантії та повернення</h2>
          <ul>
            <li>1. Загальні норми</li>
            <li>
              1.1 Під Гарантійними зобов’язаннями мається на увазі зобов’язання
              продавця щодо відповідності товару, який він постачає, чинним
              стандартам якості та заявленим технічним характеристикам, а також
              підтверджується, що продукція була вироблена з дотриманням
              технологічних вимог, що застосовуються до цього виробу.
            </li>
            <li>
              1.2 Ці правила стосуються всіх угод купівлі-продажу, укладених з
              магазином https://yogatech.com.ua/. Здійснюючи замовлення, клієнт
              автоматично погоджується із запропонованими гарантійними
              зобов’язаннями, зобов’язується дотримуватись правил,
              запропонованих компанією.
            </li>
            <li>2. Гарантійний термін</li>
            <li>
              2.1 Гарантійний термін безпосередньо залежить від виду товару, що
              поставляється магазином:
            </li>
            <li>
              2.2 Постачальник не несе відповідальності за некоректне
              використання товарів як для первинного покупця, так і для третіх
              осіб.
            </li>
            <li>
              2.3 Термін дії гарантійних зобов’язань стартує від дня відправки
              товару від продавця до покупця.
            </li>
            <li>3. Правила виконання зобов’язань сторонами</li>
            <li>
              3.1 Претензії щодо виявлених та доведених у товарі дефектів
              приймаються лише за умови дотримання замовником таких вимог:
              <ul class="list__secondary">
                <li>
                  наявність товару без слідів ушкоджень різної етіології, що
                  вказують, що несправність могла бути заподіяна або точно
                  заподіяна цими ушкодженнями;
                </li>
                <li>
                  наявність документа, що підтверджує факт купівлі товару у
                  цьому магазині, підійде товарний чек або накладна;
                </li>
              </ul>
            </li>
            <li>
              3.2 При виявленні несправності або гарантійного випадку товару,
              покупцю необхідно повідомити про це продавця за електронною
              поштою, вказаною на сайті. При цьому необхідно детально описати
              несправність, доклавши до повідомлення фото та відео продукції. У
              разі потреби продавець може попросити вислати товар для проведення
              експертизи. Повернення товару здійснюється силами та за рахунок
              Покупця.
            </li>
            <li>
              3.3. Термін розгляду заявки від клієнта становить 7 днів з моменту
              отримання магазином заяви про визнання гарантійного випадку.
            </li>
            <li>
              3.4 Продавець та покупець мають однакове право запросити незалежну
              експертизу.
            </li>
            <li>
              3.5 При виконанні обміну або повернення коштів, передбачених
              Гарантійною угодою, відповідальність продавця дорівнює вартості
              товару, що бере участь у суперечці, на момент укладання угоди
              Покупки.
            </li>
            <li>
              3.6 Продавець знімає з себе гарантійні зобов’язання у ряді
              випадків:
              <ul class="list__secondary">
                <li>
                  дефекти та пошкодження викликані некоректними експлуатацією та
                  доглядом за придбаним товаром;
                </li>
                <li>
                  експлуатація в екстремальних умовах або граничні навантаження,
                  що суперечать інструкції щодо використання товару.
                </li>
              </ul>
            </li>
            <li>4. Повернення товару</li>
            <li>
              4.1 Відповідно до чинного законодавства вимоги покупця щодо
              виконання обміну або повернення товару підлягають позитивному
              рішенню:
              <ul class="list__secondary">
                <li>якщо товар не був в експлуатації;</li>
                <li>
                  не має слідів використання споживачем: подряпин, сколів,
                  потертостей, плям тощо;
                </li>
                <li>
                  товар повністю укомплектований та збережено фабричне
                  пакування;
                </li>
                <li>збережено всі ярлики та заводське маркування;</li>
                <li>
                  товар зберігає товарний вигляд та його споживчі можливості не
                  порушені;
                </li>
                <li>
                  збережено документацію, що підтверджує факт купівлі товару в
                  магазині.
                </li>
              </ul>
            </li>
            <li>
              4.2 Термін пред’явлення вимоги про повернення або обмін – 14
              (чотирнадцять) днів з моменту укладання договору купівлі або
              будь-якої миті до відправлення товару покупцю. (відповідно до
              Закону України “Про захист прав споживача”).
            </li>
            <li>
              4.3 Кошти за інформаційну продукцію, що розповсюджується на сайті
              поверненню не підлягають, оскільки продукт може бути зкопійовано.
            </li>
            <li>
              4.4 Покупець зобов’язується компенсувати інтернет-магазину всі
              транспортні витрати, пов’язані з необхідністю організувати
              повторне перевезення товару до складу компанії, якщо вина магазину
              не доведена.
            </li>
            <li>5. Відправлення продукції сторонніми перевізниками</li>
            <li>
              5.1. Клієнт має право скористатися послугою постачання товару
              обраною транспортною компанією або поштовим перевізником. У такому
              разі, відповідальність, що утворюється за терміни доставки,
              цілісність і збереження товару на момент перевезення, приймає на
              себе транспортна компанія в момент передачі вантажу зі складу
              компанії продавця. Цей факт підтверджується виданою транспортною
              квитанцією або, згідно з внутрішнім статутом компанії перевізника,
              накладною. Чек є доказом передачі товару до служби доставки, і
              знімає з продавця подальшу відповідальність за вантаж на момент
              транспортування.
            </li>
            <li>
              5.2 Відповідність якості товару покупець зобов’язується перевіряти
              безпосередньо у момент отримання товару на складі транспортної
              компанії, яка виконує доставку.
            </li>
            <li>
              5.3 Ризик випадкового знищення товару або його псування переходить
              на покупця відразу після підписання накладної в компанії
              вантажоперевезень і не підлягає оскарженню без належних причин.
            </li>
            <li>
              Дякуємо, що обрали <NuxtLink to="/" class="text-3">yogatech.com.ua!</NuxtLink>
            </li>
          </ul>
        </div>
      </div>
    </div>
  </div>
</template>

<script setup lang="ts"></script>

<style lang="sass" scoped>
.list__secondary
  list-style: disc
  padding-left: 40px

a
  color: var(--blue-color)
  text-decoration: underline
</style>
