import {
  type IProduct,
  type ICourse,
  ProductGroup,
  DifficultyLevel
} from '../types'

export default function useShop() {
  const products: IProduct[] = [
    {
      id: 1,
      title: 'Книга “Технологія йоги” Михайла Ахекяна',
      description:
        'Перед вами практичний путівник у світ йоги, написаний йогом і адресований йогам. У книзі пояснена квінтесенція йогічної філософії, структуровані усі її основні терміни та інструменти. Усе науково, лаконічно, без двозначностей, протиріч, містики та релігійних домішок. Вона є ідеальним варіантом для першої з йоги, однак і знайомі із йогою читачі знайдуть у ній багато корисних ключів для покращення власної практики та розуміння йоги вцілому.',
      shortDescription:
        'Практичний путівник, написаний йогом та адресований йогам.',
      price: 500,
      photos: [
        '/images/book/cover.jpg',
        '/images/book/1.png',
        '/images/book/2.png',
        '/images/book/3.png',
        '/images/book/4.png'
      ],
      payment_link: 'https://secure.wayforpay.com/button/bda9be6a04c63',
      slug: 'book',
      video: 'https://www.youtube.com/embed/Mqa60lgJ1Bk?si=tfYUt29jtqCdlafu'
    },
    {
      id: 2,
      title: 'Брендована біла футболка YOGATECH',
      description:
        'Неймовірна футболка зі 100% бавовни, принт з якісної фарби, що не вимивається.',
      shortDescription:
        'Неймовірна футболка зі 100% бавовни, принт з якісної фарби, що не вимивається.',
      price: 500,
      photos: [
        '/images/t_shirt/1.jpg',
        '/images/t_shirt/2.jpg',
        '/images/t_shirt/3.jpg'
      ],
      payment_link: 'https://secure.wayforpay.com/button/b59dbc10c8495',
      slug: 't-shirt',
      sizes: [
        { id: 1, value: 'S' },
        { id: 2, value: 'M' },
        { id: 3, value: 'L' },
        { id: 4, value: 'XL' }
      ],
      sizesImg: '/images/t-shirt_sizes_table.png',
      selectedSize: { id: 1, value: 'S' }
    },
    {
      id: 3,
      title: 'Рюкзак YogaTech від Fram Equipment 30L',
      description: [
        'Оплативши 1000 грн, ви зможете не лише забронювати за собою такий рюкзачок та отримати його одним з перших, а й зекономити значну суму коштів. Орієнтовна вартість кінцевого продукту - 6000грн, але по передзамовленню вона буде суттєво нижчою.',
        'Легкий рюкзак в місто, на тренування та на одноденні сходження. Легка, водозахисна, технологічна тканина поєднана з великою кількістю кишень, регулюванням ролл-топ та захищеною кишенею для ноутбука робить рюкзак дуже практичним в горах та у місті.',
        '- Тканина X-Pac® Fabric',
        '- Крій дна, фасаду рюкзака з одного відрізу тканини',
        '- Розширюється до верху, спрощує пакування та розподіляє вагу',
        '- Закриття рюкзака на ролл-топ',
        '- Вантажні ручки на фасаді та спині',
        '- Сумісний з питною системою',
        '- Знімна грудна стяжка',
        '- Компактний поясний ремінь, що ховається в кишеню коли не потрібен',
        '- Вага 540 г',
        'Кишені:',
        '- Фасадна кишеня на водозахисній блискавці',
        '- Кишеня для ноутбука вздовж спини, ущільнена пінкою',
        '- Кишенька на блискавці для дрібниць всередині',
        '- Еластичні бічні кишені',
        '- Еластичні кишені на лямках',
        '- Чотири лінії петель для навіски речей ззовні з будь-якого боку. Не чіпляється за рельєф і важить мінімум',
        '- Петлі на фіксаторах під кріплення двох інструментів, або трекінгових палок',
        '- Перекидний ремінь для кріплення мотузки та фіксації об’єму'
      ],
      shortDescription:
        'Передзамовлення легкого та стильного рюкзака для міста, на тренування та на одноденні сходження.',
      preOrder: 'Передзамовлення',
      photos: [
        '/images/backpack/1.jpg',
        '/images/backpack/2.jpg',
        '/images/backpack/3.jpg'
      ],
      payment_link: 'https://secure.wayforpay.com/button/b5e319fa253d0',
      slug: 'backpack'
    },
    {
      id: 4,
      title: 'Худі оверсайз з логотипом YOGATECH',
      description: [
        '*Худі виготовляється під замовлення, доставка до двох тижнів.',
        '– 90% бавовни 3% еластану 7% поліестру',
        '– Щільність тканини 320 г/м2',
        '– Турецька тканина якості “пен’є”',
        'Худі за унікальними лекалами в 4х розмірах. Спущені плече та рукав. Збільшена ширина і комфортна довжина виробу. Комфортний збільшений капюшон. У виробництві використовуються найкращі тканини і матеріали, а розмір оверсайз відповідає стандартній розмірній сітці.'
      ],
      shortDescription: 'Стильне худі оверсайз з яскравим принтом асоціації.',
      price: 2000,
      photos: [
        '/images/hoodie/1.jpg',
        '/images/hoodie/2.jpg',
        '/images/hoodie/3.jpg',
        '/images/hoodie/4.jpg'
      ],
      sizes: [
        { id: 1, value: 'S' },
        { id: 2, value: 'M' },
        { id: 3, value: 'L' },
        { id: 4, value: 'XL' }
      ],
      sizesImg: '/images/hoodie_sizes_table.png',
      payment_link: 'https://secure.wayforpay.com/button/bd8a49732f0f3',
      slug: 'hoodie'
    },
    {
      id: 5,
      title: 'Худі оверсайз з логотипом YOGATECH Shiva',
      description: [
        '*Худі виготовляється під замовлення, доставка до двох тижнів.',
        '– 90% бавовни 3% еластану 7% поліестру',
        '– Щільність тканини 320 г/м2',
        '– Турецька тканина якості “пен’є”',
        'Худі за унікальними лекалами в 4х розмірах. Спущені плече та рукав. Збільшена ширина і комфортна довжина виробу. Комфортний збільшений капюшон. У виробництві використовуються найкращі тканини і матеріали, а розмір оверсайз відповідає стандартній розмірній сітці.'
      ],
      shortDescription: 'Стильне худі оверсайз з яскравим принтом асоціації.',
      price: 2000,
      photos: [
        '/images/hoodie_shiva/1.jpg',
        '/images/hoodie_shiva/2.jpg',
        '/images/hoodie_shiva/3.jpg',
        '/images/hoodie_shiva/4.jpg'
      ],
      sizes: [
        { id: 1, value: 'S' },
        { id: 2, value: 'M' },
        { id: 3, value: 'L' },
        { id: 4, value: 'XL' }
      ],
      sizesImg: '/images/hoodie_sizes_table.png',
      payment_link: 'https://secure.wayforpay.com/button/b3a7002af9b8f',
      slug: 'hoodie-shiva'
    },
    {
      id: 6,
      title: 'Штани-шаровари унісекс Elephant Noir RAO WEAR',
      description: [
        "Відкрийте для себе світ комфорту та стилю зі східними штанами а-ля гарем  «Elephant Noir RAO WEAR »!",
        "Шукаєте універсальний стиль для йоги або просто мрієте про комфортний домашній аутфіт? Наші унісекс-штани ONE Size ідеально підходять як для жінок так і для чоловіків, обіцяючи незрівнянний комфорт і свободу рухів.",
        "Виготовлені з натуральної віскози, штани «Elephant Noir» дарують відчуття прохолоди та легкості навіть у найспекотніший день.",
        "Етнічний принт із зображенням слонів додасть заряд йогічного настрою та виразності вашому поряд, а гумка на талії підкреслить вашу фігуру та забезпечить комфорт на весь день.",
        "Характеристики:",
        "- Висока посадка чудово підкреслює фігуру.",
        "- Розмір: ONE Size, універсально підходить від XS до L.",
        "- Ростовка: є 3 варіанти росту: від 155 до 165 см; від 166 до 175 см; від 176 до 185 см.",
        "- Пояс: комфортна гумка + зав'язки не стискають талію.",
        "- Щиколотки: еластичні гумки для практичної посадки.",
        "- Матеріал: 100% натуральна віскоза для повітропроникності та легкості.",
        "- Кишеня: зручна бічна накладна кишеня.",
        "- Дизайн: східно-індійський бохостиль із зображенням слонів.",
        "- Колір: класичний і стильний чорний колір Noir.",
        "- Догляд: Машинне прання за 30 °C.",
        "Увага! Відтінок виробу може трохи відрізнятися від того, що на фото через світлопередачу вашого екрана та освітлення."

      ],
      shortDescription: 'Унісекс-штани ONE Size ідеально підходять як для жінок так і для чоловіків, обіцяючи незрівнянний комфорт і свободу рухів.',
      price: 890,
      photos: [
        '/images/sharovary-raowear/1.jpg',
        '/images/sharovary-raowear/2.jpg',
        '/images/sharovary-raowear/3.jpg',
        '/images/sharovary-raowear/4.jpg',
        '/images/sharovary-raowear/5.jpg'
      ],
      payment_link: 'https://secure.wayforpay.com/button/ba3e565fbc909',
      slug: 'sharovary-raowear'
    }
  ]

  const courses: ICourse[] = [
    {
      id: 1,
      title: 'Медитація 2.0',
      shortDescription:
        '9 лекцій, у які утрамбовано понад 9 років особистої практики. Фішки та лайф-хаки, спрощення та ускладнення, розуміння механіки роботи технік та будови психіки.',
      description:
        'Запис трансляцій нашого найбільш популярного курсу. 9 лекцій, у які утрамбовано понад 9 років моєї особистої практики. Фішки та лайф-хаки, спрощення та ускладнення, розуміння механіки роботи технік та будови психіки.',
      price: 2000,
      photos: ['/images/course_meditation.png'],
      video: 'https://www.youtube.com/embed/pcHIiXtsD3o?si=jC0VDrSLGoOh5IDP',
      payment_link: 'https://secure.wayforpay.com/payment/s75209e762efb',
      slug: 'course-meditation-2.0',
      level: DifficultyLevel.MIDDLE,
      levelUA: 'середній',
      lectures: [
        'Лекція 1 - Руйнуємо стереотипи та будуємо чітке розуміння теми. Напрацьовуємо концентрацію',
        'Лекція 2 - Розбираємо будову психіки, ускладнюємо практики на концентрацію',
        "Лекція 3 - Тренування пам'яті. Техніка та її ефекти",
        'Лекція 4 - Практика підйому Кундаліні. Що воно таке та чим корисне',
        'Лекція 5 - Медитативні техніки для роботи із панічними атаками та негативними поведінковими паттернами ',
        'Лекція 6 - Самадхі та алгоритм його досягнення',
        'Лекція 7 - Свара йога, як спосіб покращення роботи мозку',
        'Лекція 8 - Інструкція до подальшої самостійної практики',
        'Лекція 9 - Бонус. Аутогенне тренування, як мікс медитації та самогіпнозу'
      ],
      author: 'від Михайла Ахекяна'
    },
    {
      id: 2,
      title: 'Аутогенне тренування',
      shortDescription:
        'Аутогенне тренування - це суміш медитації та самогіпнозу. Курс складається з семи україномовних аудіо-уроків, які необхідно засвоювати крок за кроком.',
      description:
        'Аутогенне тренування - це суміш медитації та самогіпнозу. Воно базується на концепції, що людина може самостійно впливати на свій психічний та фізичний стан шляхом концентрації на внутрішніх відчуттях та самонавіюванню (ауто-сугестії). На PubMed є понад 1300 наукових досліджень цього психотерапевтичного методу, що підтверджують його ефективність у зменшенні симптомів стресу, тривожності та депресії, а також у покращенні сну та спортивних результатів (що закономірно, адже чим меньше стресу - тим краще відновлення та вищий ступінь концентрації).',
      price: 1500,
      photos: ['/images/course_autogenic.png'],
      video: 'https://www.youtube.com/embed/TCB3o-Rog7w?si=GQxnNTbNxdRB6xUr',
      payment_link: 'https://secure.wayforpay.com/payment/s58e50ece0f0f',
      slug: 'course-autogenic-training',
      level: DifficultyLevel.MIDDLE,
      levelUA: 'середній',
      lectures: [
        'Курс складається з семи україномовних аудіо-уроків, які необхідно засвоювати крок за кроком. Під кожним відео є чітка інструкція до самостійної практики, а також поради до вирішення можливих проблем.',
        'Урок 1 - Важкість',
        'Урок 2 - Тепло',
        'Урок 3 - Регуляція дихання',
        'Урок 4 - Регуляція серцебиття',
        'Урок 5 - Регуляція роботи внутрішніх органів',
        'Урок 6 - Прохолода',
        'Урок 7 - Збірна практика усіх попередніх частин'
      ],
      author: 'від Михайла Ахекяна'
    },
    {
      id: 3,
      title: 'Інтро у йогу',
      shortDescription:
        'Базовий курс, що буде корисний усім початківцям. У ньому ми поговоримо про історію йоги, її цілі та інструменти.',
      description:
        "Базовий курс, що буде корисний усім початківцям. У ньому ми поговоримо про історію йоги, її цілі та інструменти. Таким чином, цей курс може стати приємним та стійким фундаментом, своєрідним скелетом на який можна сміливо нарощувати м'язи вашої особистої практики.",
      price: 800,
      photos: ['/images/course_intro.png'],
      video: 'https://www.youtube.com/embed/PPesedU1FOc?si=261cqDgQ-w-3jZWy',
      payment_link: 'https://secure.wayforpay.com/payment/sf7f35357e856',
      slug: 'course-intro',
      level: DifficultyLevel.LIGHT,
      levelUA: 'легкий',
      lectures: [
        'Лекція 1 - Коротка історія йоги',
        'Лекція 2 - Яма і Ніяма',
        'Лекція 3 - Шаткарми',
        'Лекція 4 - Асани',
        'Лекція 5 - Пранаяма',
        'Лекція 6 - Пратьяхара',
        'Лекція 7 - Медитатації',
        'Лекція 8 - Харчування'
      ],
      author: 'від Михайла Ахекяна'
    }
  ]

  const getOneProduct = (slug: string, group: ProductGroup) => {
    return group === ProductGroup.PRODUCT
      ? products.filter((p) => p.slug === slug)[0]
      : courses.filter((c) => c.slug === slug)[0]
  }

  const getProductsExceptSelected = (slug: string, group: ProductGroup) => {
    return group === ProductGroup.PRODUCT
      ? products.filter((p) => p.slug !== slug)
      : courses.filter((c) => c.slug !== slug)
  }

  return {
    products,
    courses,
    getOneProduct,
    getProductsExceptSelected
  }
}
