import type { ITeammate } from "~/types"

export default function useTeammates() {
  const teammates: Ref<ITeammate[]> = useState("teammates", () => [
    {
      id: 1,
      coverImg: "/images/teammates/mykhailo-akhekian/poster.jpg",
      photos: [
        "/images/teammates/mykhailo-akhekian/01.jpg",
        "/images/teammates/mykhailo-akhekian/02.jpg",
        "/images/teammates/mykhailo-akhekian/03.jpg",
        "/images/teammates/mykhailo-akhekian/04.jpg",
        "/images/teammates/mykhailo-akhekian/05.jpg"
      ],
      name: "Михайло Ахекян",
      description:
        "Маю за плечима 12 років особистої практики, сто тисяч переглядів на ютуб, тисячі проведених занять, сотні майстер-класів, десятки здобутих сертифікатів, низка наукових публікацій, три вищі освіти та написану книгу. Пишаюсь тим, що перш ніж створити власний викладацький курс, протягом кількох років викладав у трьох викладацьких програмах. Люблю поєднувати непоєднуване, наприклад викладати йогу в католицькому університеті, музичній школі чи на рок фестивалі.",
      achievements: [
        "2012 – Розпочав особисту практику;",
        "2018 – Отримав посвяту в Махаріші Махеш-йогу;",
        "2018 – Пройшов навчання з Кундаліні-йоги у традиції Карта Сінгха (Марія Федосєєва);",
        "2018 – Пройшов “Йога-інтенсив” (В'ячеслав Гуцалюк);",
        "2019 – Здобув сертифікат у міжнародній школі вчителів Кундаліні-йоги K.R.I.Y.A. (Сергій Філімонов та Наталія Дубенкова);",
        '2019 – Створив авторський курс "Медитація 2,0";',
        "2019 – Співведучий курсу для викладачів Кундаліні-йоги (Марія Федосєєва);",
        '2019 – 2020 – Лектор на таких фестивалях як "Аватар", "Кундаліні-йога", "Кульбаба";',
        "2019 – 2020 - Отримав сертифікацію у школі Девдан-йоги (Олена Бакай) та співведучий викладач на курсі школи Девдан протягом двох років;",
        "2019 - 2022 - Проводив майстер-класи з йоги та дихальної гімнастики для студентів Українського Католицького Університету;",
        "2020 – Як інструктор, ознайомився з викладацькими програмами шкіл Андрія Сідерського, Андрія Лаппи, Анатолія Зенченка;",
        "2020 – Прослухав експрес курс для викладачів від Московського центру Аштанга-йоги (Агапкін, Бабкін);",
        '2020 – Спікер та співорганізатор конференції "Devdan yoga international";',
        '2020 – Створив авторські курси "Інтро в йогу" та "Прана, що воно таке, та як її їдять";',
        '2021 – Пройшов курси гіпнотерапії від американської школи "Омні" (500 годин);',
        "2021 – Проводив заняття з йоги на сцені “Захід-фест”;",
        "2021 – 2023 – Спікер на Carpathian yoga fest;",
        "2021 – Започаткував ютуб-канал “YogaTech”;",
        "2022 – Завершив десяти тижневий курс WimHofMethod;",
        "2022 – Отримав сертифікацію з флай-йоги (Катерина Чернова);",
        "2023 – Спікер на “Level up! Internacionale yoga conference” (разом з Гуру Гхі та Б’янкою Олівейра);",
        "2023 – Отримав два сертифікати від “Fitness Academy”;",
        "2023 – Пройшов курс “Animal gymnastic yoga” (Костянтин Ронін);",
        "2023 – Зробив низку наукових публікацій у журналах, зокрема “Йогатерапія у корекції наслідків ПТСР” та “Особливості застосування йогатерапії при травмах ЦНС”;"
      ],
      intro: "Засновник YogaTech, лектор, викладач йоги, ментор",
      video: "https://www.youtube.com/embed/-UY_vLmb2UQ?si=Eey_vekUQgEfv06a",
      motivation:
        "У суспільстві, де технологічний прогрес катастрофічно випереджає розвиток людської психіки, йога - чи не єдина протиотрута",
      slug: "mykhailo-akhekian",
      socials: [
        {
          icon: "ph:instagram-logo-thin",
          link: "https://www.instagram.com/mikeyogatech/"
        },
        {
          icon: "ph:facebook-logo-thin",
          link: "https://www.facebook.com/share/FSd8J9DVW6DkmURn/?mibextid=LQQJ4d"
        }
      ]
    },
    {
      id: 2,
      coverImg: "/images/teammates/miriam-khmarska/poster.jpg",
      photos: [
        "/images/teammates/miriam-khmarska/01.jpg",
        "/images/teammates/miriam-khmarska/02.jpg",
        "/images/teammates/miriam-khmarska/03.jpg",
        "/images/teammates/miriam-khmarska/04.jpg",
        "/images/teammates/miriam-khmarska/05.jpg",
        "/images/teammates/miriam-khmarska/06.jpg"
      ],
      name: "Міріам Хмарська",
      description:
        "Викладачка йоги, менеджер, організатор, веб-дизайнер, а ще хімік-полімерщик. Але саме йога дає мені відчуття наповненості, впевненості, внутрішньої рівноваги та спокою. І мені дуже хочеться, щоб все більше людей відкривали для себе користь та оздоровчі властивості йоги, яка підтримує не тільки тіло, а й психіку. Саме тому я продовжую практикувати, навчатись, ділитись, щоб люди пізнавали йогу, яка базується на науці, дослідженнях, досвіді.",
      achievements: [
        "2020 - Розпочала особисту практику;",
        '2020 - 2024 - Відвідала семінари "Основи йоги", "Внутрішня робота з тілом в асані", "Дихальні техніки йоги" від IshvaraYoga, "Йога під час вагітності та після пологів"  Валентини Малиновської;',
        '2022 - 2024 - Пройшла курси "Медитація 2.0" Михайла Ахекяна, "Animal Gymnastic Yoga" Костянтина Роніна, "Пранаяма - серце йоги" Вікторії Колбас;',
        "2023 - Отримала сертифікацію RYT-200 (1 рівень йогатерапії) в школі SENSE International Yoga&Therapy Center Олени Бакай;",
        "2022 - 2023 - Відвідала класи сцени Prof Carpathian Yoga Fest;",
        '2023 - Працювала менеджером в Carpathian Yoga Fest, організовувала йога-марафони, ретрити, челенджі. Втілила в життя проект "CYF Online Club", який функціонує надалі;',
        '2023 - Викладала йогу та йогатерапію тривожних станів для людей, які постраждали від війни, у БФ "Інші" м.Львів'
      ],
      intro: "Голова культурного відділу асоціацї, викладачка йоги, менеджер",
      motivation:
        "У сучасному світі, де турботи та стрес диктують ритм, йога - це дихання, яке дарує нам спокій.",
      slug: "miriam-khmarska",
      socials: [
        {
          icon: "ph:instagram-logo-thin",
          link: "https://www.instagram.com/miriam_khmarska_yogini/"
        }
      ]
    },
    {
      id: 3,
      coverImg: "/images/teammates/kate-tarasenko/poster.jpg",
      photos: [
        "/images/teammates/kate-tarasenko/01.jpg",
        "/images/teammates/kate-tarasenko/02.jpg",
        "/images/teammates/kate-tarasenko/03.jpg",
        "/images/teammates/kate-tarasenko/04.jpg"
      ],
      name: "Катерина Тарасенко",
      description:
        "Зважаючи на сучасний ритм життя та стресові ситуації, йога стала для мене не лише практикою, але й способом знайти внутрішню гармонію. Провідна моя думка - це те, що йога може принести користь кожному, незалежно від віку чи фізичної підготовки. Щодня я відчуваю, як ця давня практика змінює не лише моє тіло, але й моє ставлення до життя, роблячи його більш гармонійним і радісним.",
      achievements: [
        "2007 - 2019 – Професійно займалася танцями (займала призові місця та готувалась до КМС);",
        "2018 – Викладала в танцювальній студії «Kosmos Dance»;",
        "2019 – Вступила до Херсонського державного університету на спеціальність «Хореографія»;",
        "2021 – Операція на коліні, яка привела на реабілітацію в йогу;",
        "2021 – Розпочала особисту практику;",
        "2021 - 2022 – Стала співвласницею танцювальної студії «Kosmos»;",
        "2022 – Відвідала класи сцени Base Carpathian Yoga Fest, пройшла базове навчання у Михайла Ахекяна, влаштувалась у йога студію «Прана» м. Львів, працювала у реабілітаційному центрі «Dzhevaha Gym» м. Київ;",
        "2023 – Закінчила університет та отримала диплом бакалавра - «Балмейстер. Постановник»;",
        "2023 – Пройшла курси 'Інтро у Йогу' Михайла Ахекяна, влаштувалась в йога студію «So.flexi» м. Київ;",
        "2023 – Відвідала класи сцени Prof Carpathian Yoga Fest, працювала в йога студію «Woow.space»;",
        "2024 – По запрошенню провела на майстер-класі зі стретчінгу медитацію для жінок, отримала сертифікат з курсу «Цвяхостояння», проводжу онлайн та офлайн заняття в Києві."
      ],
      intro: "Викладачка йоги, балетмейстер, майстриня цвяхостояння",
      motivation:
        "У просторі йоги - між вдихом та видихом я відчуваю себе вільною, мов крила, які несуть мене у світло моєї власної істини.",
      slug: "kate-tarasenko",
      socials: [
        {
          icon: "ph:instagram-logo-thin",
          link: "https://www.instagram.com/littlebird_kate?igsh=MWwybXRsNTZoNnU3Mg=="
        }
      ]
    },
    {
      id: 4,
      coverImg: "/images/teammates/alice-moroz/poster.jpg",
      photos: [
        "/images/teammates/alice-moroz/01.jpg",
        "/images/teammates/alice-moroz/02.jpg",
        "/images/teammates/alice-moroz/03.jpg",
        "/images/teammates/alice-moroz/04.jpg",
        "/images/teammates/alice-moroz/05.jpg",
        "/images/teammates/alice-moroz/06.jpg",
      ],
      name: "Аліса Мороз",
      description:
        "Викладач йоги, провідник на цвяхи, майстер звукових медитацій, а ще я мама двох прекрасних дівчат. Почала практикувати йогу 10 років назад, пройшовши шлях від початківця до викладача, провідника на цвяхи, звуко-терапевта, та власниці йога студії. Щороку я долучаюсь до майстер-класів, семінарів, курсів, йога-фестивалів, щоб підвищувати свій рівень. Для мене йога - це не просто фізичні вправи, але і шлях розкриття внутрішнього світу і розуміння навколишнього. Це спосіб заспокоїти розум, зміцнити тіло і вирівняти емоції. Практика йоги допомагає мені знаходити гармонію та баланс у житті, навчає бути присутнім у кожному моменті і цінувати його.",
      achievements: [
        "2014 – Розпочала практикувати йогу (Юрій Сулик, Марта Чорна);",
        "2015 – Регулярна практика до і під час вагітності з Мартою Чорною;",
        "2016 - 2020 – Відновлення після пологів, особиста практика, друга вагітність, відновлення після пологів;",
        "2021 – Регулярна практика:",
        "- Онлайн: курси Марти Чорної;",
        "- Офлайн: Ігор Левченко(Tapasya Yoga), Ольга Кузьмич (ADHOyoga);",
        "- Онлайн майстер класи: Равіндер Джанга, Бʼянка Олівейра, Мукеш Кумар Рай, Селім Генісол;",
        "- В кінці року отримала сертифікацію Yoga Teacher Devdan International Yoga School.",
        "2022 – Проводила заняття з йоги онлайн та офлайн у різних студіях Франківська, проводила заняття у проекті Йога для українців;",
        "Онлайн майстер класи: Едуард Голяк, Олена Бакай, Константин Русов, Мукеш Кумар Рай, Ігор Ткачьов, Валентина Маліновська, Равіндер Джангра, Володимир Жданов;",
        "Онлайн: Карпатський Йога Фест, CYF Online Club;",
        "Опанувала цвяхостояння, пройшла декілька курсів які не можу рекомендувати, та на власному досвіді стала провідником на цвяхи;",
        "В кінці року відкрила студію йоги Yoga Space 13 в Івано-Франківську;",
        "2023 – Отримала сертифікацію Звукотерапевта:  від Анастасії Стульнікової (Україна), а також рік навчання з Андрієм Сутугінасом (Литва);",
        "Відвідала Carpathian Yoga Fest в Ізках;",
        "Офлайн майстер класи: Михайло Ахекян, Ксенія Голуб (Школа Сідерського);",
        "Онлайн майстер класи: Констянтин Ронін, Едуард Голяк, Ravinder Jangra, Andrew Eppler, Олена Бакай, Наталя Салітра, Валентина Маліновська, Наталія Артемчук, курс «Йога під час вагітності та після пологів» Валентини Маліновської від Balance Yoga School, курс «Animal Gymnastic Yoga» Констянтин Ронін;",
        "Йога конференція з Равіндером Джангра;",
        "Проводжу заняття за власним авторським методом «Медитація на цвяхах», поставила більше 300 людей на цвяхи в легкості;",
        "Проводжу звукові медитації за власним авторським методом та виїзні практики на ретритах та конференціях;",
        "2024 – Відвідала офлайн майстер класи: Михайло Ахекян, Регіна Раїнська."
      ],
      intro: "Викладач йоги, провідник на цвяхи, майстер звукових медитацій",
      motivation:
        "Життя - це подорож, варто навчитись насолоджуватися кожним кроком.",
      slug: "alice-moroz",
      socials: [
        {
          icon: "ph:instagram-logo-thin",
          link: "https://www.instagram.com/alice_in_mountain"
        },
        {
          icon: "ph:instagram-logo-thin",
          link: "https://www.instagram.com/yogaspace13.if"
        }
      ]
    },
    {
      id: 5,
      coverImg: "/images/teammates/anastasia-maryan/poster.jpg",
      photos: [
        "/images/teammates/anastasia-maryan/01.jpg",
        "/images/teammates/anastasia-maryan/02.jpg",
        "/images/teammates/anastasia-maryan/03.jpg",
        "/images/teammates/anastasia-maryan/04.jpg"
      ],
      name: "Анастасія Марʼян",
      description:
        "Спорт завжди був у моєму житті, але коли я вперше познайомилася з йогою, вона вразила мене своєю глибиною та комплексністю. Робота з тілом та розумом дозволила значно покращити своє фізичне та психологічне самопочуття. Я відчуваю себе щасливою та вдячною за цей шлях, що відкрився переді мною, і за можливість розвиватися. Хороше здоров'я - це моє надбання, результат багаторічної праці над собою і я впевнена, що так може кожен. Мій досвід у роботі з учнями, як індивідуально, так і в групах, дозволяє мені використовувати ефективні методи, які допомагають їм досягати своїх цілей.",
      achievements: [
        "2017 – Розпочала особисту практику медитації;",
        "2019 – Розпочала особисту практику йоги;",
        "2019 – Розпочала особисту практику йоги;",
        "2021 – Здобула сертифікат RYT-200 в школі YOGA&MEDICINE TEACHER TRAINING у Олени Бакай і стала викладати йогу;",
        "2022 – Завдяки практиці йоги та дихальним вправам вивела себе із тривожних станів;",
        "2022 – Відвідала майстер-класи з йоги на фестивалі Аватар;",
        "2022 – Була майстром на фестивалі Аватар;",
        "2023 – Була майстром на фестивалі Обрій;",
        "2023 – Відвідала навчальні майстер-класи CYF у викладачів: Олени Бакай, Едуарда Голяка, Костянтина Роніна, Равіндера Джангра, Наталії Салітри, Василя Герасімова;",
        "2023 – Пройшла курси «Медитація 2.0» Михайла Ахекяна;",
        "2024 – Відвідала майстер-класи «Алгоритм відбудови асан» та «Підготовка кистей до балансів» від Михайла Ахекяна;",
        "2024 – Провела дослідження впливу дихальних вправ на організм людини з двадцятьма учасниками;",
        "2024 – Була запрошена викладачем з йоги на пʼятиденний жіночий ретрит."
      ],
      intro:
        "Викладач йоги, коуч, провідник цвяхостояння та майстер чайних церемоній",
      motivation:
        "Кожна практика з йоги - це зустріч з собою, де пізнається власна сила і мудрість.",
      slug: "anastasia-maryan",
      socials: [
        {
          icon: "ph:instagram-logo-thin",
          link: "https://www.instagram.com/taya_soul__?igsh=dDBqd28wcWJ0MW52"
        },
        { icon: "ph:telegram-logo-thin", link: "https://t.me/Anastasyaa_soul" }
      ]
    },
    {
      id: 6,
      coverImg: "/images/teammates/snizhana-yaremchuk/poster.jpg",
      photos: [
        "/images/teammates/snizhana-yaremchuk/01.jpg",
        "/images/teammates/snizhana-yaremchuk/02.jpg",
        "/images/teammates/snizhana-yaremchuk/03.jpg",
        "/images/teammates/snizhana-yaremchuk/04.jpg"
      ],
      name: "Сніжана Яремчук",
      description:
        "П’ять років особистої практики йоги дали мені можливість краще пізнати себе і Світ довкола. Одного разу мені прийшло розуміння, що я готова не лише приймати, а й віддавати, ділитися досвідом з людьми, закохувати їх в йогу. Наразі, викладаю в маленькій сільській школі. Радію, що йога стає доступною не лише для містян. Також вивчаю йога-терапію, маю велике бажання покращувати якість життя людей використовуючи ці знання на практиці. Йога багатогранна. Вивчення та засвоєння цих граней - ось моя мета.",
      achievements: [
        "2015 - 2017 – Особиста практика у різних викладачів;",
        "2022 – Відновлення практики;",
        "2023 – Отримала  сертифікацію RYT-100 в школі SENSE International Yoga&Therapy Center Олени Бакай;",
        "2023 – Розпочала викладати йогу;",
        "2024 – Пройшла  сертифікацію RYT-200 (1 рівень йогатерапії) в школі SENSE International Yoga&Therapy Center Олени Бакай, написала 3 курсові роботи по йога-терапії: робота з плоскостопістю, сколіозом, болями в попереку;",
        "2024 – Приймаю участь у CYF Online Club, де регулярно відвідую онлайн майстер-класи в різних викладачів, збагачуючи власну практику."
      ],
      intro: "Викладачка йоги",
      motivation:
        "Якщо постійно роздумувати над тим, що таке йога, то в кінці кінців можна прийти до висновку, що йога - це присутність в собі. Будь-яка діяльність може стати йогою, якщо робити її свідомо.",
      slug: "snizhana-yaremchuk",
      socials: [
        {
          icon: "ph:instagram-logo-thin",
          link: "https://www.instagram.com/yaremchuk.snizhana"
        }
      ]
    },
    {
      id: 7,
      coverImg: "/images/teammates/olha-yashchenko/poster.jpg",
      photos: [
        "/images/teammates/olha-yashchenko/01.jpg",
        "/images/teammates/olha-yashchenko/02.jpg",
        "/images/teammates/olha-yashchenko/03.jpg",
        "/images/teammates/olha-yashchenko/04.jpg",
        "/images/teammates/olha-yashchenko/05.jpg",
        "/images/teammates/olha-yashchenko/06.jpg",
        "/images/teammates/olha-yashchenko/07.jpg",
        "/images/teammates/olha-yashchenko/08.jpg"
      ],
      name: "Ольга Ященко",
      description:
        "Я прийшла в йогу через тривожні стани, панічні атаки. Це був мій порятунок. Біжучи в студію, як на роботу, я жила лише від заняття до заняття. Зрештою, я змогла подолати свою хворобу, але йога стала наркотиком. Вже через 11 місяців власної практики я пішла на курс йогатічерів. Так хвороба подарувала мені нову професію - йога викладач. Для мене йога - це поєднання тіла з диханням і розумом. В буденному житті ми намагаємось все контролювати, від цього зʼявляється тривога, якщо щось не виправдовує наших очікувань. На килимку ми контролюємо лише дихання і тіло. В цей момент мозок розслабляється, перезавантажується і не думає про буденні проблеми. В цьому і полягає ціль йоги.",
      achievements: [
        "2020 – Початок власної практики;",
        "2020 – Пройшла перший модуль з курсу «Аюрведа» від Юлії Степури;",
        "2021 – Пройшла курс для йога викладачів в стилі Balance Yoga від Валентини Малиновської;",
        "2022 – Успішно здала іспит і отримала сертифікат RYT-200 від Валентини Малиновської;",
        "2023 – Почала викладати йогу в студії Yogaspace13 в Івано-Франківську;",
        "2023 – Відвідала семінар Михайла Ахекяна;",
        "2024 – Орендувала зал і набрала власну групу;",
        "2024 – Відвідала три семінари Михайла Ахекяна."
      ],
      intro: "Викладачка йоги",
      motivation:
        "Мета йоги одна. Усунути перешкоди, які заважають людям повною мірою насолоджуватись своїм життям.",
      slug: "olha-yashchenko",
      socials: [
        {
          icon: "ph:instagram-logo-thin",
          link: "https://www.instagram.com/olha_yashchenko?igsh=MThsejAycjBvenlhcA=="
        }
      ]
    }
  ])

  const getOneTeammate = (slug: string) =>
    teammates.value.filter((teammate) => teammate.slug === slug)[0]

  const getTeammatesExceptCurrent = (slug: string) =>
    teammates.value.filter((teammate) => teammate.slug !== slug)

  return {
    teammates,
    getOneTeammate,
    getTeammatesExceptCurrent
  }
}
