import type { ITeammate } from '~/types'

export default function useTeammates() {
  const teammates: Ref<ITeammate[]> = useState('teammates', () => [
    {
      id: 1,
      coverImg: '/images/michael/cover.jpg',
      photos: [
        '/images/michael/1.jpg',
        '/images/michael/2.jpg',
        '/images/michael/3.jpg',
        '/images/michael/4.jpg',
        '/images/michael/5.jpg'
      ],
      name: 'Михайло Ахекян',
      description: 'Маю за плечима 12 років особистої практики, сто тисяч переглядів на ютуб, тисячі проведених занять, сотні майстер-класів, десятки здобутих сертифікатів, низка наукових публікацій, три вищі освіти та написану книгу. Пишаюсь тим, що перш ніж створити власний викладацький курс, протягом кількох років викладав у трьох викладацьких програмах. Люблю поєднувати непоєднуване, наприклад викладати йогу в католицькому університеті, музичній школі чи на рок фестивалі.',
      achievements: [
        '2012 – Розпочав особисту практику;',
        '2018 – Отримав посвяту в Махаріші Махеш-йогу;',
        '2018 – Пройшов навчання з Кундаліні-йоги у традиції Карта Сінгха (Марія Федосєєва);',
        "2018 – Пройшов “Йога-інтенсив” (В'ячеслав Гуцалюк);",
        '2019 – Здобув сертифікат у міжнародній школі вчителів Кундаліні-йоги K.R.I.Y.A. (Сергій Філімонов та Наталія Дубенкова);',
        '2019 – Створив авторський курс "Медитація 2,0";',
        '2019 – Співведучий курсу для викладачів Кундаліні-йоги (Марія Федосєєва);',
        '2019 – 2020 – Лектор на таких фестивалях як "Аватар", "Кундаліні-йога", "Кульбаба";',
        '2019 – 2020 - Отримав сертифікацію у школі Девдан-йоги (Олена Бакай) та співведучий викладач на курсі школи Девдан протягом двох років;',
        '2019-2022 - Проводив майстер-класи з йоги та дихальної гімнастики для студентів Українського Католицького Університету;',
        '2020 – Як інструктор, ознайомився з викладацькими програмами шкіл Андрія Сідерського, Андрія Лаппи, Анатолія Зенченка;',
        '2020 – Прослухав експрес курс для викладачів від Московського центру Аштанга-йоги (Агапкін, Бабкін);',
        '2020 – Спікер та співорганізатор конференції "Devdan yoga international";',
        '2020 – Створив авторські курси "Інтро в йогу" та "Прана, що воно таке, та як її їдять";',
        '2021 – Пройшов курси гіпнотерапії від американської школи "Омні" (500 годин);',
        '2021 – Проводив заняття з йоги на сцені “Захід-фест”;',
        '2021 – 2023 – Спікер на Carpathian yoga fest;',
        '2021 – Започаткував ютуб-канал “YogaTech”;',
        '2022 – Завершив десяти тижневий курс WimHofMethod;',
        '2022 – Отримав сертифікацію з флай-йоги (Катерина Чернова);',
        '2023 – Спікер на “Level up! Internacionale yoga conference” (разом з Гуру Гхі та Б’янкою Олівейра);',
        '2023 – Отримав два сертифікати від “Fitness Academy”;',
        '2023 – Пройшов курс “Animal gymnastic yoga” (Костянтин Ронін);',
        '2023 – Зробив низку наукових публікацій у журналах, зокрема “Йогатерапія у корекції наслідків ПТСР” та “Особливості застосування йогатерапії при травмах ЦНС”;'
      ],
      intro: 'засновник YogaTech, лектор, викладач йоги, ментор',
      video: 'https://www.youtube.com/embed/ZM3CBfx_IK8?si=QsXbf4fFw3ifFA_q',
      motivation: 'У суспільстві, де технологічний прогрес катастрофічно випереджає розвиток людської психіки, йога - чи не єдина протиотрута',
      instagramLink: 'https://www.instagram.com/mikeyogatech/',
      slug: 'mykhailo-akhekian'
    },
    {
      id: 2,
      coverImg: '/images/miriam/cover.jpg',
      photos: [
        '/images/miriam/2.jpg',
        '/images/miriam/3.jpg',
        '/images/miriam/4.jpg',
        '/images/miriam/5.jpg',
        '/images/miriam/6.jpg',
        '/images/miriam/7.jpg'
      ],
      name: 'Міріам Хмарська',
      description: 'Викладачка йоги, менеджер, організатор, веб-дизайнер, а ще хімік-полімерщик. Але саме йога дає мені відчуття наповненості, впевненості, внутрішньої рівноваги та спокою. І мені дуже хочеться, щоб все більше людей відкривали для себе користь та оздоровчі властивості йоги, яка підтримує не тільки тіло, а й психіку. Саме тому я продовжую практикувати, навчатись, ділитись, щоб люди пізнавали йогу, яка базується на науці, дослідженнях, досвіді.',
      achievements:
        [
          '2020 - Розпочала особисту практику;',
          '2020 - 2024 - Відвідала семінари "Основи йоги", "Внутрішня робота з тілом в асані", "Дихальні техніки йоги" від IshvaraYoga, "Йога під час вагітності та після пологів"  Валентини Малиновської;',
          '2022-2024 - Пройшла курси "Медитація 2.0" Михайла Ахекяна, "Animal Gymnastic Yoga" Костянтина Роніна, "Пранаяма - серце йоги" Вікторії Колбас;',
          '2023 - Отримала сертифікацію RYT-200 (1 рівень йогатерапії) в школі SENSE International Yoga&Therapy Center Олени Бакай;',
          '2022-2023 - Відвідала класи сцени Prof Carpathian Yoga Fest;',
          '2023 - Працювала менеджером в Carpathian Yoga Fest, організовувала йога-марафони, ретрити, челенджі. Втілила в життя проект "CYF Online Club", який функціонує надалі;',
          '2023 - Викладала йогу та йогатерапію тривожних станів для людей, які постраждали від війни, у БФ "Інші" м.Львів'
        ],
      intro: 'голова культурного відділу асоціацї, викладачка йоги, менеджер',
      motivation: 'У сучасному світі, де турботи та стрес диктують ритм, йога - це дихання, яке дарує нам спокій.',
      instagramLink: 'https://www.instagram.com/miriam_khmarska_yogini/',
      slug: 'miriam-khmarska'
    },
    // {
    //   id: 3,
    //   coverImg: '/images/kate.png',
    //   photos: [],
    //   name: 'Катерина Ковальчук',
    //   description: 'jfnejvrnv',
    //   achievements: [
    //     'jnjk'
    //   ],
    //   intro: 'голова відділу маркетингу асоціації, бізнес-коуч, ментор',
    //   motivation: 'ervev',
    //   instagramLink: 'https://www.instagram.com/kovalchuk.kateryna?igsh=ZjMzd2oyMHFjZWZ3',
    //   slug: 'kate'
    // }
  ])

  const getOneTeammate = (slug: string) =>
    teammates.value.filter((teammate) => teammate.slug === slug)[0]

  const getTeammatesExceptCurrent = (slug: string) =>
    teammates.value.filter((teammate) => teammate.slug !== slug)

  return {
    teammates,
    getOneTeammate,
    getTeammatesExceptCurrent
  }
}
