import type { ITeammate } from '~/types'

export default function useTeammates() {
  const teammates: Ref<ITeammate[]> = useState('teammates', () => [
    {
      id: 1,
      img: '/images/miha.png',
      name: 'Михайло Ахекян',
      description:
        `
        2012 – Розпочав особисту практику;<br />
        2018 – Отримав посвяту в Махаріші Махеш-йогу;<br />
        2018 – Пройшов навчання з Кундаліні-йоги у традиції Карта Сінгха (Марія Федосєєва);<br />
        2018 – Пройшов “Йога-інтенсив” (В'ячеслав Гуцалюк);<br />
        2019 – Здобув сертифікат у міжнародній школі вчителів Кундаліні-йоги K.R.I.Y.A.
        (Сергій Філімонов та Наталія Дубенкова);<br />
        2019 – Створив авторський курс "Медитація 2,0";<br />
        2019 – Співведучий курсу для викладачів Кундаліні-йоги (Марія Федосєєва);<br />
        2019 – 2020 – Лектор на таких фестивалях як "Аватар", "Кундаліні-йога",
        "Кульбаба";<br />
        2019 – 2020 - Отримав сертифікацію у школі Девдан-йоги (Олена Бакай) та
        співведучий викладач на курсі школи Девдан протягом двох років;<br />
        2019-2022 - Проводив майстер-класи з йоги та дихальної гімнастики для студентів Українського Католицького Університету;<br />
        2020 – Як інструктор, ознайомився з викладацькими програмами шкіл Андрія
        Сідерського, Андрія Лаппи, Анатолія Зенченка;<br />
        2020 – Прослухав експрес курс для викладачів від Московського центру Аштанга-
        йоги (Агапкін, Бабкін);<br />
        2020 – Спікер та співорганізатор конференції "Devdan yoga international";<br />
        2020 – Створив авторські курси "Інтро в йогу" та "Прана, що воно таке, та як її їдять";<br />
        2021 – Пройшов курси гіпнотерапії від американської школи "Омні" (500 годин);<br />
        2021 – Проводив заняття з йоги на сцені “Захід-фест”;<br />
        2021 – 2023 – Спікер на Carpathian yoga fest;<br />
        2021 – Започаткував ютуб-канал “YogaTech”;<br />
        2022 – Завершив десяти тижневий курс WimHofMethod;<br />
        2022 – Отримав сертифікацію з флай-йоги (Катерина Чернова);<br />
        2023 – Спікер на “Level up! Internacionale yoga conference” (разом з Гуру Гхі та Б’янкою Олівейра);<br />
        2023 – Отримав два сертифікати від “Fitness Academy”;<br />
        2023 – Пройшов курс “Animal gymnastic yoga” (Костянтин Ронін);<br />
        2023 – Зробив низку наукових публікацій у журналах, зокрема “Йогатерапія у корекції наслідків ПТСР” та “Особливості застосування йогатерапії при травмах ЦНС”;`,
      intro: 'засновник асоціації, викладач йоги',
      instagramLink: 'https://www.instagram.com/mikeyogatech/',
      slug: 'miha'
    },
    {
      id: 2,
      img: '/images/mirka.png',
      name: 'Міріам Хмарська',
      description:
        'голова культурного відділу асоціацї,  викладачка йоги, менеджер',
      intro: 'голова культурного відділу асоціацї,  викладачка йоги, менеджер',
      instagramLink: 'https://www.instagram.com/miriam_khmarska_yogini/',
      slug: 'mirka'
    },
    {
      id: 3,
      img: '/images/kate.png',
      name: 'Катерина Ковальчук',
      description: 'голова відділу маркетингу асоціації, бізнес-коуч, ментор',
      intro: 'голова відділу маркетингу асоціації, бізнес-коуч, ментор',
      instagramLink: 'https://www.instagram.com/miriam_khmarska_yogini/',
      slug: 'kate'
    }
  ])

  const getOneTeammate = (slug: string) =>
    teammates.value.filter((teammate) => teammate.slug === slug)[0]

  const getTeammatesExceptCurrent = (slug: string) => teammates.value.filter((teammate) => teammate.slug !== slug)

  return {
    teammates,
    getOneTeammate,
    getTeammatesExceptCurrent
  }
}
