import type { ITeammate } from "~/types"

export default function useTeammates() {
  const teammates: Ref<ITeammate[]> = useState("teammates", () => [
    {
      id: 1,
      coverImg: "/images/teammates/michael/cover.jpg",
      photos: [
        "/images/teammates/michael/1.jpg",
        "/images/teammates/michael/2.jpg",
        "/images/teammates/michael/3.jpg",
        "/images/teammates/michael/4.jpg",
        "/images/teammates/michael/5.jpg"
      ],
      name: "Михайло Ахекян",
      description:
        "Маю за плечима 12 років особистої практики, сто тисяч переглядів на ютуб, тисячі проведених занять, сотні майстер-класів, десятки здобутих сертифікатів, низка наукових публікацій, три вищі освіти та написану книгу. Пишаюсь тим, що перш ніж створити власний викладацький курс, протягом кількох років викладав у трьох викладацьких програмах. Люблю поєднувати непоєднуване, наприклад викладати йогу в католицькому університеті, музичній школі чи на рок фестивалі.",
      achievements: [
        "2012 – Розпочав особисту практику;",
        "2018 – Отримав посвяту в Махаріші Махеш-йогу;",
        "2018 – Пройшов навчання з Кундаліні-йоги у традиції Карта Сінгха (Марія Федосєєва);",
        "2018 – Пройшов “Йога-інтенсив” (В'ячеслав Гуцалюк);",
        "2019 – Здобув сертифікат у міжнародній школі вчителів Кундаліні-йоги K.R.I.Y.A. (Сергій Філімонов та Наталія Дубенкова);",
        '2019 – Створив авторський курс "Медитація 2,0";',
        "2019 – Співведучий курсу для викладачів Кундаліні-йоги (Марія Федосєєва);",
        '2019 – 2020 – Лектор на таких фестивалях як "Аватар", "Кундаліні-йога", "Кульбаба";',
        "2019 – 2020 - Отримав сертифікацію у школі Девдан-йоги (Олена Бакай) та співведучий викладач на курсі школи Девдан протягом двох років;",
        "2019 - 2022 - Проводив майстер-класи з йоги та дихальної гімнастики для студентів Українського Католицького Університету;",
        "2020 – Як інструктор, ознайомився з викладацькими програмами шкіл Андрія Сідерського, Андрія Лаппи, Анатолія Зенченка;",
        "2020 – Прослухав експрес курс для викладачів від Московського центру Аштанга-йоги (Агапкін, Бабкін);",
        '2020 – Спікер та співорганізатор конференції "Devdan yoga international";',
        '2020 – Створив авторські курси "Інтро в йогу" та "Прана, що воно таке, та як її їдять";',
        '2021 – Пройшов курси гіпнотерапії від американської школи "Омні" (500 годин);',
        "2021 – Проводив заняття з йоги на сцені “Захід-фест”;",
        "2021 – 2023 – Спікер на Carpathian yoga fest;",
        "2021 – Започаткував ютуб-канал “YogaTech”;",
        "2022 – Завершив десяти тижневий курс WimHofMethod;",
        "2022 – Отримав сертифікацію з флай-йоги (Катерина Чернова);",
        "2023 – Спікер на “Level up! Internacionale yoga conference” (разом з Гуру Гхі та Б’янкою Олівейра);",
        "2023 – Отримав два сертифікати від “Fitness Academy”;",
        "2023 – Пройшов курс “Animal gymnastic yoga” (Костянтин Ронін);",
        "2023 – Зробив низку наукових публікацій у журналах, зокрема “Йогатерапія у корекції наслідків ПТСР” та “Особливості застосування йогатерапії при травмах ЦНС”;"
      ],
      intro: "Засновник YogaTech, лектор, викладач йоги, ментор",
      video: "https://www.youtube.com/embed/-UY_vLmb2UQ?si=Eey_vekUQgEfv06a",
      motivation:
        "У суспільстві, де технологічний прогрес катастрофічно випереджає розвиток людської психіки, йога - чи не єдина протиотрута",
      slug: "mykhailo-akhekian",
      socials: [
        {icon: 'ph:instagram-logo-thin', link: 'https://www.instagram.com/mikeyogatech/'},
        {icon: 'ph:facebook-logo-thin', link: 'https://www.facebook.com/share/FSd8J9DVW6DkmURn/?mibextid=LQQJ4d'}
      ]
    },
    {
      id: 2,
      coverImg: "/images/teammates/miriam/cover.jpg",
      photos: [
        "/images/teammates/miriam/2.jpg",
        "/images/teammates/miriam/3.jpg",
        "/images/teammates/miriam/4.jpg",
        "/images/teammates/miriam/5.jpg",
        "/images/teammates/miriam/6.jpg",
        "/images/teammates/miriam/7.jpg"
      ],
      name: "Міріам Хмарська",
      description:
        "Викладачка йоги, менеджер, організатор, веб-дизайнер, а ще хімік-полімерщик. Але саме йога дає мені відчуття наповненості, впевненості, внутрішньої рівноваги та спокою. І мені дуже хочеться, щоб все більше людей відкривали для себе користь та оздоровчі властивості йоги, яка підтримує не тільки тіло, а й психіку. Саме тому я продовжую практикувати, навчатись, ділитись, щоб люди пізнавали йогу, яка базується на науці, дослідженнях, досвіді.",
      achievements: [
        "2020 - Розпочала особисту практику;",
        '2020 - 2024 - Відвідала семінари "Основи йоги", "Внутрішня робота з тілом в асані", "Дихальні техніки йоги" від IshvaraYoga, "Йога під час вагітності та після пологів"  Валентини Малиновської;',
        '2022 - 2024 - Пройшла курси "Медитація 2.0" Михайла Ахекяна, "Animal Gymnastic Yoga" Костянтина Роніна, "Пранаяма - серце йоги" Вікторії Колбас;',
        "2023 - Отримала сертифікацію RYT-200 (1 рівень йогатерапії) в школі SENSE International Yoga&Therapy Center Олени Бакай;",
        "2022 - 2023 - Відвідала класи сцени Prof Carpathian Yoga Fest;",
        '2023 - Працювала менеджером в Carpathian Yoga Fest, організовувала йога-марафони, ретрити, челенджі. Втілила в життя проект "CYF Online Club", який функціонує надалі;',
        '2023 - Викладала йогу та йогатерапію тривожних станів для людей, які постраждали від війни, у БФ "Інші" м.Львів'
      ],
      intro: "Голова культурного відділу асоціацї, викладачка йоги, менеджер",
      motivation:
        "У сучасному світі, де турботи та стрес диктують ритм, йога - це дихання, яке дарує нам спокій.",
      slug: "miriam-khmarska",
      socials: [
        {icon: 'ph:instagram-logo-thin', link: 'https://www.instagram.com/miriam_khmarska_yogini/'}
      ]
    },
    {
      id: 3,
      coverImg: "/images/teammates/alice/cover.jpg",
      photos: [
        "/images/teammates/alice/1.jpg",
        "/images/teammates/alice/2.jpg",
        "/images/teammates/alice/3.jpg",
      ],
      name: "Аліса Мороз",
      description:
        "Викладач йоги, провідник на цвяхи, майстер звукових медитацій, а ще я мама двох прекрасних дівчат. Почала практикувати йогу 10 років назад, пройшовши шлях від початківця до викладача, провідника на цвяхи, звуко-терапевта, та власниці йога студії. Щороку я долучаюсь до майстер-класів, семінарів, курсів, йога-фестивалів, щоб підвищувати свій рівень. Для мене йога - це не просто фізичні вправи, але і шлях розкриття внутрішнього світу і розуміння навколишнього. Це спосіб заспокоїти розум, зміцнити тіло і вирівняти емоції. Практика йоги допомагає мені знаходити гармонію та баланс у житті, навчає бути присутнім у кожному моменті і цінувати його.",
      achievements: [
        "2014 – Розпочала практикувати йогу (Юрій Сулик, Марта Чорна);",
        "2015 – Регулярна практика до і під час вагітності з Мартою Чорною;",
        "2016 - 2020 – Відновлення після пологів, особиста практика, друга вагітність, відновлення після пологів;",
        "2021 – Регулярна практика:",
        "- Онлайн: курси Марти Чорної;",
        "- Офлайн: Ігор Левченко(Tapasya Yoga), Ольга Кузьмич (ADHOyoga);",
        "- Онлайн майстер класи: Равіндер Джанга, Бʼянка Олівейра, Мукеш Кумар Рай, Селім Генісол;",
        "- В кінці року отримала сертифікацію Yoga Teacher Devdan International Yoga School.",
        "2022 – Проводила заняття з йоги онлайн та офлайн у різних студіях Франківська, проводила заняття у проекті Йога для українців;",
        "Онлайн майстер класи: Едуард Голяк, Олена Бакай, Константин Русов, Мукеш Кумар Рай, Ігор Ткачьов, Валентина Маліновська, Равіндер Джангра, Володимир Жданов;",
        "Онлайн: Карпатський Йога Фест, CYF Online Club;",
        "Опанувала цвяхостояння, пройшла декілька курсів які не можу рекомендувати, та на власному досвіді стала провідником на цвяхи;",
        "В кінці року відкрила студію йоги Yoga Space 13 в Івано-Франківську;",
        "2023 – Отримала сертифікацію Звукотерапевта:  від Анастасії Стульнікової (Україна), а також рік навчання з Андрієм Сутугінасом (Литва);",
        "Відвідала Carpathian Yoga Fest в Ізках;",
        "Офлайн майстер класи: Михайло Ахекян, Ксенія Голуб (Школа Сідерського);",
        "Онлайн майстер класи: Констянтин Ронін, Едуард Голяк, Ravinder Jangra, Andrew Eppler, Олена Бакай, Наталя Салітра, Валентина Маліновська, Наталія Артемчук, курс «Йога під час вагітності та після пологів» Валентини Маліновської від Balance Yoga School, курс «Animal Gymnastic Yoga» Констянтин Ронін;",
        "Йога конференція з Равіндером Джангра;",
        "Проводжу заняття за власним авторським методом «Медитація на цвяхах», поставила більше 300 людей на цвяхи в легкості;",
        "Проводжу звукові медитації за власним авторським методом та виїзні практики на ретритах та конференціях;",
        "2024 – Відвідала офлайн майстер класи: Михайло Ахекян, Регіна Раїнська."
      ],
      intro: "Викладач йоги, провідник на цвяхи, майстер звукових медитацій",
      motivation:
        "Життя - це подорож, варто навчитись насолоджуватися кожним кроком.",
      slug: "alice-moroz",
      socials: [
        {icon: 'ph:instagram-logo-thin', link: 'https://www.instagram.com/alice_in_mountain'},
        {icon: 'ph:instagram-logo-thin', link: 'https://www.instagram.com/yogaspace13.if'}
      ]
    },
    {
      id: 4,
      coverImg: "/images/teammates/kate/cover.jpg",
      photos: [
        "/images/teammates/kate/1.jpg",
        "/images/teammates/kate/2.jpg",
        "/images/teammates/kate/3.jpg",
        "/images/teammates/kate/4.jpg"
      ],
      name: "Катерина Тарасенко",
      description:
        "Зважаючи на сучасний ритм життя та стресові ситуації, йога стала для мене не лише практикою, але й способом знайти внутрішню гармонію. Провідна моя думка - це те, що йога може принести користь кожному, незалежно від віку чи фізичної підготовки. Щодня я відчуваю, як ця давня практика змінює не лише моє тіло, але й моє ставлення до життя, роблячи його більш гармонійним і радісним.",
      achievements: [
        "2007 - 2019 – Професійно займалася танцями (займала призові місця та готувалась до КМС);",
        "2018 – Викладала в танцювальній студії «Kosmos Dance»;",
        "2019 – Вступила до Херсонського державного університету на спеціальність «Хореографія»;",
        "2021 – Операція на коліні, яка привела на реабілітацію в йогу;",
        "2021 – Розпочала особисту практику;",
        "2021 - 2022 – Стала співвласницею танцювальної студії «Kosmos»;",
        "2022 – Відвідала класи сцени Base Carpathian Yoga Fest, пройшла базове навчання у Михайла Ахекяна, влаштувалась у йога студію «Прана» м. Львів, працювала у реабілітаційному центрі «Dzhevaha Gym» м. Київ;",
        "2023 – Закінчила університет та отримала диплом бакалавра - «Балмейстер. Постановник»;",
        "2023 – Пройшла курси 'Інтро у Йогу' Михайла Ахекяна, влаштувалась в йога студію «So.flexi» м. Київ;",
        "2023 – Відвідала класи сцени Prof Carpathian Yoga Fest, працювала в йога студію «Woow.space»;",
        "2024 – По запрошенню провела на майстер-класі зі стретчінгу медитацію для жінок, отримала сертифікат з курсу «Цвяхостояння», проводжу онлайн та офлайн заняття в Києві."
      ],
      intro: "Викладачка йоги, балетмейстер, майстриня цвяхостояння",
      motivation:
        "У просторі йоги - між вдихом та видихом я відчуваю себе вільною, мов крила, які несуть мене у світло моєї власної істини.",
      slug: "kate-tarasenko",
      socials: [
        {icon: 'ph:instagram-logo-thin', link: 'https://www.instagram.com/littlebird_kate?igsh=MWwybXRsNTZoNnU3Mg=='}
      ]
    },
  ])

  const getOneTeammate = (slug: string) =>
    teammates.value.filter((teammate) => teammate.slug === slug)[0]

  const getTeammatesExceptCurrent = (slug: string) =>
    teammates.value.filter((teammate) => teammate.slug !== slug)

  return {
    teammates,
    getOneTeammate,
    getTeammatesExceptCurrent
  }
}
