<template>
  <div class="section">
    <div class="container">
      <BaseGoBackBtn />

      <div class="terms">
        <div>
          <h2>Оплата</h2>
          <div class="terms__text">
            <p>
              На даний момент в інтернет-магазині доступний єдиний варіант
              оплати товару, через сервіс WayForPay.
            </p>
            <p>
              Увага! У замовленні вказано лише вартість товару. Комісійні, які
              стягуються банком за переказ, не враховані. При оплаті за
              розрахунковий рахунок (IBAN) комісія від ПриватБанку становить 1
              грн. (Ваш банк може брати додаткову комісію). Будь ласка,
              зберігайте квитанції з банку щодо оплати товару.
            </p>
            <p>
              Доставка товару оплачується покупцем окремо згідно з тарифами
              перевізника.
            </p>
            <p>
              Для прискорення процесу відправлення замовлення рекомендуємо
              повідомити менеджера про факт оплати за тел через e-mail: <NuxtLink
                to="mailto:yogatechua@gmail.com"
                >yogatechua@gmail.com</NuxtLink
              >
            </p>
            <p>
              *Товари по передзамовленню: При замовленні товару, що відшивається
              або привозиться на замовлення, ви можете вибрати один із двох
              варіантів оплати: Внесення передоплати у розмірі 30% вартості
              товару для підтвердження замовлення. Повна оплата товару у момент
              оформлення замовлення.
            </p>
            <p>
              У разі вибору передоплати сума, що залишилася, оплачується після
              повідомлення про готовність товару до відправки або при отриманні
              товару.
            </p>
          </div>
        </div>

        <div>
          <h2>Доставка</h2>
          <div class="terms__text">
            <p>
              Доставка можлива у будь-який населений пункт України та
              здійснюється компаніями “Нова Пошта”, “Укрпошта”. Ваша покупка
              буде надіслана на адресу, вказану при заповненні форми.
            </p>
            <p>
              Відправка “Новою Поштою” здійснюється в день отримання замовлення
              (якщо воно оформлено до 16:00) або наступного дня (крім вихідних).
            </p>
            <p>
              Відправлення “Укрпоштою” здійснюється протягом 7 робочих днів.
            </p>
            <p>
              Якщо вам потрібне термінове відправлення, прохання зв’язатися з
              нами та вказати це у замовленні. Відстежити ваше замовлення ви
              можете на сайті «Нової Пошти» за номером експрес-накладної, який
              ми повідомимо після відправлення.
            </p>
            <p>
              Якщо ви замовляєте товар «на замовлення», то про терміни доставки
              вас додатково проінформує менеджер. Термін поставки товару
              залежить від його наявності складі виробника, і зазвичай становить
              від 14-21 дня.
            </p>
            <p>
              Для мешканців Львова найпростіший спосіб – самостійно забрати своє
              замовлення у зручний час у нашому офісі за адресою: вул.
              Горбачевського 4, м. Львів. (ТІЛЬКИ ЗА ПОПЕРЕДНІМ УЗГОДЖЕННЯМ  ІЗ
              НАШИМ МЕНЕДЖЕРОМ).
            </p>
          </div>
        </div>

        <div>
          <h2>Контактна інформація</h2>
          <p>ФОП Ахекян Михайло Артемович;</p>
          <p>ЄДРПОУ: 3413609999</p>
          <p>
            Юр. адреса: 79057, м. Львів, вул. Тернопільська, будинок 9, офіс 13;
          </p>
          <p>тел: (099) 647-61-58</p>
        </div>
      </div>
    </div>
  </div>
</template>

<script setup lang="ts"></script>

<style lang="sass" scoped>
.terms
  display: flex
  flex-direction: column
  gap: 40px
  @include xl
    gap: 28px
  @include l
    gap: 20px
  @include m
    gap: 12px

.terms__text
  display: flex
  flex-direction: column
  gap: 20px
  width: 80%
  @include xl
    width: 90%
  @include m
    width: 100%
    gap: 12px

  & a
    color: var(--blue-color)
    text-decoration: underline
</style>
